src/cf/Catalogs/QuestionnaireTemplates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QuestionnaireTemplates</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Introduction</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Conclusion</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemplateEditCompleted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/QuestionnaireTemplateQuestionTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>QuestionnaireTemplateQuestionTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Basic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>QuestionWithCondition</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tabular</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Complex</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/QuestionnaireTemplateQuestions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QuestionnaireTemplateQuestions</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.QuestionnaireTemplates</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Wording</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Required</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QuestionsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionnaireTemplateQuestionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TabularQuestionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TabularQuestionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ElementaryQuestion</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentQuestion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QuestionnaireTemplateQuestions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Notes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HintPlacement</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TooltipDisplayMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>TabularQuestionComposition</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PredefinedAnswers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Response</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.QuestionsForSurvey</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ComplexQuestionComposition</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ElementaryQuestion</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.QuestionsForSurvey</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/QuestionnaireTemplates/Forms/ListForm/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Clone, Parent, Folder)
	
	If Clone
		AND Not Folder Then
		
		CurrentData = Items.List.CurrentData;
		If CurrentData <> Undefined Then
			
			Cancel = True;
			NewItemRef = ExecuteItemCopying(CurrentData.Ref);
			If NewItemRef <> Undefined Then
				OpenForm("Catalog.QuestionnaireTemplates.Form.ItemForm",New Structure("Key",NewItemRef));
				Items.List.Refresh();
			EndIf;
			
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Function ExecuteItemCopying(CopyingItem)
	
	BeginTransaction();
	Try
	
		QuestionnaireTemplateObject = Catalogs.QuestionnaireTemplates.CreateItem();
		
		FillPropertyValues(QuestionnaireTemplateObject,CopyingItem,"DeletionMark,Description,Title,Introduction,Conclusion");
		QuestionnaireTemplateObject.SetNewObjectRef(Catalogs.QuestionnaireTemplates.GetRef());
		QuestionnaireTemplateObject.TemplateEditCompleted = False;
		QuestionnaireTemplateObject.Write();
		
		Query = New Query;
		Query.Text = "
		|SELECT
		|	QuestionnaireTemplateQuestions.Ref AS Ref,
		|	QuestionnaireTemplateQuestions.DeletionMark,
		|	QuestionnaireTemplateQuestions.Predefined,
		|	QuestionnaireTemplateQuestions.Owner,
		|	QuestionnaireTemplateQuestions.Parent,
		|	QuestionnaireTemplateQuestions.IsFolder,
		|	QuestionnaireTemplateQuestions.Code AS Code,
		|	QuestionnaireTemplateQuestions.Description,
		|	QuestionnaireTemplateQuestions.Required,
		|	QuestionnaireTemplateQuestions.QuestionsType,
		|	QuestionnaireTemplateQuestions.TabularQuestionType,
		|	QuestionnaireTemplateQuestions.ElementaryQuestion,
		|	QuestionnaireTemplateQuestions.ParentQuestion,
		|	QuestionnaireTemplateQuestions.ToolTip AS ToolTip,
		|	QuestionnaireTemplateQuestions.HintPlacement AS HintPlacement,
		|	QuestionnaireTemplateQuestions.TabularQuestionComposition.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.PredefinedAnswers.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		Response,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.ComplexQuestionComposition.(
		|		ElementaryQuestion AS ElementaryQuestion,
		|		LineNumber
		|	),
		|	QuestionnaireTemplateQuestions.Wording
		|FROM
		|	Catalog.QuestionnaireTemplateQuestions AS QuestionnaireTemplateQuestions
		|WHERE
		|	QuestionnaireTemplateQuestions.Owner = &QuestionnaireTemplate
		|
		|ORDER BY
		|	Ref HIERARCHY,
		|	Code";
		
		Query.SetParameter("QuestionnaireTemplate", CopyingItem);
		
		Result = Query.Execute();
		
		Selection = Result.Select(QueryResultIteration.ByGroupsWithHierarchy);
		AddQuestionnaireTemplateQuestionsCatalogItems(QuestionnaireTemplateObject.Ref, Selection);
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		Return Undefined;
		
	EndTry;
	
	Return QuestionnaireTemplateObject.Ref;
	
EndFunction

&AtServer
Procedure AddQuestionnaireTemplateQuestionsCatalogItems(Ref, Selection, Parent = Undefined)
	
	QuestionsWithCondition = New Map;
	
	While Selection.Next() Do
		
		If Selection.IsFolder Then
			
			NewItem = Catalogs.QuestionnaireTemplateQuestions.CreateFolder();
			FillPropertyValues(NewItem,Selection,"Description,Code,Wording");
			
		Else
			
			NewItem = Catalogs.QuestionnaireTemplateQuestions.CreateItem();
			
			NewRef = Catalogs.QuestionnaireTemplateQuestions.GetRef();
			NewItem.SetNewObjectRef(NewRef);
			
			FillPropertyValues(NewItem,Selection,,"Owner,Parent,TabularQuestionComposition,PredefinedAnswers,ComplexQuestionComposition,Code,ParentQuestion");
			TableQuestionComposition = Selection.TabularQuestionComposition.Unload();
			TableQuestionComposition.Sort("LineNumber Asc");
			NewItem.TabularQuestionComposition.Load(TableQuestionComposition);
			PredefinedAnswers = Selection.PredefinedAnswers.Unload();
			PredefinedAnswers.Sort("LineNumber Asc");
			NewItem.PredefinedAnswers.Load(PredefinedAnswers);
			ComplexQuestionComposition = Selection.ComplexQuestionComposition.Unload();
			ComplexQuestionComposition.Sort("LineNumber Asc");
			NewItem.ComplexQuestionComposition.Load(ComplexQuestionComposition);
			
			If Selection.QuestionsType = Enums.QuestionnaireTemplateQuestionTypes.QuestionWithCondition Then
				QuestionsWithCondition.Insert(Selection.Ref,NewRef);
			EndIf;
			
			If NOT Selection.ParentQuestion.IsEmpty() Then
				NewItem.ParentQuestion = QuestionsWithCondition.Get(Selection.ParentQuestion);
			EndIf;
			
		EndIf;
		
		NewItem.Owner = Ref;
		NewItem.Parent = ?(Parent = Undefined,Catalogs.QuestionnaireTemplateQuestions.EmptyRef(),Parent);
		NewItem.Write();
		
		SubordinateSelection = Selection.Select(QueryResultIteration.ByGroupsWithHierarchy);
		If SubordinateSelection.Count() > 0 Then
			AddQuestionnaireTemplateQuestionsCatalogItems(Ref,SubordinateSelection,NewItem.Ref);
		EndIf;
		
	EndDo;
	
EndProcedure

#EndRegion
